app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(class_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Science"], ["room_number", 123], ["created_at", "2020-06-15 12:53:14.652935"], ["updated_at", "2020-06-15 12:53:14.652935"]]